Revit 2027 API
BuiltInFailures.StairRampFailures.UnexpectedCurveIntersectionFailure Property
 Computing curve intersection and find the invalid result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnexpectedCurveIntersectionFailure { get; }
Public Shared ReadOnly Property UnexpectedCurveIntersectionFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnexpectedCurveIntersectionFailure {
	FailureDefinitionId^ get ();
}
static member UnexpectedCurveIntersectionFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace